#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloud_run_service.duc-bac-nginx-service will be created
  + resource "google_cloud_run_service" "duc-bac-nginx-service" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "asia-southeast1"
      + name                       = "duc-bac-nginx-service"
      + project                    = "infrateam-playground"
      + status                     = (known after apply)

      + metadata (known after apply)

      + template {
          + metadata (known after apply)
          + spec {
              + container_concurrency = 10
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "nginx:latest"
                  + name  = "duc-bac-nginx-service"

                  + ports {
                      + container_port = 80
                      + name           = (known after apply)
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "1"
                          + "memory" = "512Mi"
                        }
                    }

                  + startup_probe (known after apply)
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
          + url             = (known after apply)
        }
    }

  # google_cloud_run_service_iam_member.duc-bac-nginx_service_all_users will be created
  + resource "google_cloud_run_service_iam_member" "duc-bac-nginx_service_all_users" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "asia-southeast1"
      + member   = "allUsers"
      + project  = "infrateam-playground"
      + role     = "roles/run.invoker"
      + service  = "duc-bac-nginx-service"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cloud_run_url = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>
*Pusher: @bacducdinh, Action: `pull_request`*